In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("Bengaluru_House_Data.csv")

In [4]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Plot Area,Ready To Move,Defence Colony,10 Bedroom,NaN,7150,13.0,NaN,3600.0
1,Super built-up Area,18-Jan,Ashok Nagar,NaN,NaN,8321,5.0,2.0,2912.0
2,Plot Area,Ready To Move,Defence Colony,6 Bedroom,NaN,8000,6.0,3.0,2800.0
3,Plot Area,Ready To Move,Sadashiva Nagar,5 Bedroom,NaN,9600,7.0,2.0,2736.0
4,Super built-up Area,Ready To Move,Shanthala Nagar,5 BHK,Kierser,8321,5.0,3.0,2700.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13301 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [9]:
df.isnull()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,False,False,False,False,True,False,False,True,False
1,False,False,False,True,True,False,False,False,False
2,False,False,False,False,True,False,False,False,False
3,False,False,False,False,True,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
13315,False,False,False,False,True,False,False,False,False
13316,False,False,False,False,True,False,False,False,False
13317,False,False,False,False,True,False,False,False,False
13318,False,False,False,True,False,False,True,True,False
13319,False,False,False,False,False,False,False,False,False

In [10]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              19
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [26]:
df.isnull().sum().sum()

6204

In [27]:
df.duplicated().sum()

529

In [28]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
13315    False
13316    False
13317    False
13318    False
13319    False
Length: 13320, dtype: bool

In [30]:
df_new=df.drop_duplicates()
df.isnull().sum()

area_type          0
availability       0
location           1
size              19
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [31]:
df_new.fillna(method='pad')

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Plot Area,Ready To Move,Defence Colony,10 Bedroom,NaN,7150,13.0,NaN,3600.00
1,Super built-up Area,18-Jan,Ashok Nagar,10 Bedroom,NaN,8321,5.0,2.0,2912.00
2,Plot Area,Ready To Move,Defence Colony,6 Bedroom,NaN,8000,6.0,3.0,2800.00
3,Plot Area,Ready To Move,Sadashiva Nagar,5 Bedroom,NaN,9600,7.0,2.0,2736.00
4,Super built-up Area,Ready To Move,Shanthala Nagar,5 BHK,Kierser,8321,5.0,3.0,2700.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Attibele,1 BHK,Jae 1hu,410,1.0,1.0,10.00
13316,Super built-up Area,Ready To Move,Chandapura,1 BHK,Jae 1hu,410,1.0,1.0,10.00
13317,Built-up Area,Ready To Move,Chandapura,1 BHK,Jae 1hu,450,1.0,1.0,9.00
13318,Plot Area,Immediate Possession,Hosur Road,1 BHK,AVeldun,1350,1.0,1.0,8.44
13319,Super built-up Area,Ready To Move,Yelahanka New Town,1 BHK,KHatsFl,284,1.0,1.0,8.00

In [34]:
df_new.fillna(value=0)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Plot Area,Ready To Move,Defence Colony,10 Bedroom,0,7150,13.0,0.0,3600.00
1,Super built-up Area,18-Jan,Ashok Nagar,0,0,8321,5.0,2.0,2912.00
2,Plot Area,Ready To Move,Defence Colony,6 Bedroom,0,8000,6.0,3.0,2800.00
3,Plot Area,Ready To Move,Sadashiva Nagar,5 Bedroom,0,9600,7.0,2.0,2736.00
4,Super built-up Area,Ready To Move,Shanthala Nagar,5 BHK,Kierser,8321,5.0,3.0,2700.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Attibele,1 BHK,0,410,1.0,1.0,10.00
13316,Super built-up Area,Ready To Move,Chandapura,1 BHK,0,410,1.0,1.0,10.00
13317,Built-up Area,Ready To Move,Chandapura,1 BHK,0,450,1.0,1.0,9.00
13318,Plot Area,Immediate Possession,Hosur Road,0,AVeldun,1350,0.0,0.0,8.44
13319,Super built-up Area,Ready To Move,Yelahanka New Town,1 BHK,KHatsFl,284,1.0,1.0,8.00

In [37]:
df_new.notnull().sum()

area_type       12791
availability    12791
location        12790
size            12772
society          7463
total_sqft      12791
bath            12718
balcony         12186
price           12791
dtype: int64

In [38]:
 df_new.to_csv("bang_data.csv")

In [13]:
df_new.describe()

               bath       balcony         price
count  12718.000000  12186.000000  12791.000000
mean       2.708602      1.582308    114.317646
std        1.357764      0.822536    151.480310
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     73.000000
75%        3.000000      2.000000    121.000000
max       40.000000      3.000000   3600.000000

In [14]:
 import numpy as np
qt=np.nanpercentile(df_new['bath'],[25,50,75])
q1,q2,q3=qt[0],qt[1],qt[2]

In [15]:
print(q1,q2,q3)

2.0 2.0 3.0

In [16]:
iqr=q3-q1
iqr

1.0

In [17]:
outlier1=q1-(1.5*iqr)
outlier1

0.5

In [18]:
outlier2=q3+(1.5*iqr)
outlier2

4.5

In [19]:
df.bath.max()

40.0

In [20]:
qur=np.nanpercentile(df_new['balcony'],[25,50,75])

In [21]:
q1,q2,q3=qur[0],qur[1],qur[2]
iqr1=q3-q1

In [22]:
outb1=q1-(1.5*iqr)
outb1

-0.5

In [23]:
outb2=q3+(1.5*iqr)
outb2

3.5